{"format": "graph-model", "generatedBy": "2.3.1", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_15/conv2d_transpose/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15/conv2d_transpose/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15/conv2d_transpose/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15/conv2d_transpose/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_15/conv2d_transpose/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15/conv2d_transpose/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/functional_1/tf_op_layer_ResizeBilinear/ResizeBilinear/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_15/concatenate/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15/functional_3/tf_op_layer_ResizeBilinear_1/ResizeBilinear_1/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/concatenate_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15/functional_5/tf_op_layer_ResizeBilinear_2/ResizeBilinear_2/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/concatenate_2/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15/functional_7/tf_op_layer_ResizeBilinear_3/ResizeBilinear_3/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/concatenate_3/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15/functional_9/tf_op_layer_ResizeBilinear_4/ResizeBilinear_4/size", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "1024"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/concatenate_4/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_15/functional_11/tf_op_layer_ResizeBilinear_5/ResizeBilinear_5/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/concatenate_5/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15/functional_13/tf_op_layer_ResizeBilinear_6/ResizeBilinear_6/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "256"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/concatenate_6/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/functional_15/sequential_1/conv2d_1/Conv2D", "op": "Conv2D", "input": ["input_1", "unknown"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/functional_15/sequential_1/leaky_re_lu_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_15/sequential_1/conv2d_1/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/functional_15/sequential_2/conv2d_2/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_15/sequential_1/leaky_re_lu_1/LeakyRelu", "unknown_0"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/sequential_2/leaky_re_lu_2/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_15/sequential_2/conv2d_2/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/functional_15/sequential_3/conv2d_3/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_15/sequential_2/leaky_re_lu_2/LeakyRelu", "unknown_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/functional_15/sequential_3/leaky_re_lu_3/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_15/sequential_3/conv2d_3/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/functional_15/sequential_4/conv2d_4/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_15/sequential_3/leaky_re_lu_3/LeakyRelu", "unknown_2"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_15/sequential_4/leaky_re_lu_4/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_15/sequential_4/conv2d_4/Conv2D"], "attr": {"alpha": {"f": 0.30000001192092896}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/sequential_5/conv2d_5/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_15/sequential_4/leaky_re_lu_4/LeakyRelu", "unknown_3"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/sequential_5/leaky_re_lu_5/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_15/sequential_5/conv2d_5/Conv2D"], "attr": {"alpha": {"f": 0.30000001192092896}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/sequential_6/conv2d_6/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_15/sequential_5/leaky_re_lu_5/LeakyRelu", "unknown_4"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_15/sequential_6/leaky_re_lu_6/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_15/sequential_6/conv2d_6/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/functional_15/sequential_7/conv2d_7/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_15/sequential_6/leaky_re_lu_6/LeakyRelu", "unknown_5"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/functional_15/sequential_7/leaky_re_lu_7/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_15/sequential_7/conv2d_7/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/functional_15/sequential_8/conv2d_8/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_15/sequential_7/leaky_re_lu_7/LeakyRelu", "unknown_6"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/functional_15/sequential_8/leaky_re_lu_8/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_15/sequential_8/conv2d_8/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/functional_15/functional_1/tf_op_layer_ResizeBilinear/ResizeBilinear", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/functional_15/sequential_8/leaky_re_lu_8/LeakyRelu", "StatefulPartitionedCall/functional_15/functional_1/tf_op_layer_ResizeBilinear/ResizeBilinear/size"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_15/functional_1/conv2d_9/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_15/functional_1/tf_op_layer_ResizeBilinear/ResizeBilinear", "unknown_7"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/functional_1/re_lu/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_15/functional_1/conv2d_9/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/concatenate/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_15/functional_1/re_lu/Relu", "StatefulPartitionedCall/functional_15/sequential_7/leaky_re_lu_7/LeakyRelu", "StatefulPartitionedCall/functional_15/concatenate/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/functional_3/tf_op_layer_ResizeBilinear_1/ResizeBilinear_1", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/functional_15/concatenate/concat", "StatefulPartitionedCall/functional_15/functional_3/tf_op_layer_ResizeBilinear_1/ResizeBilinear_1/size"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_15/functional_3/conv2d_10/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_15/functional_3/tf_op_layer_ResizeBilinear_1/ResizeBilinear_1", "unknown_8"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/functional_15/functional_3/re_lu_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_15/functional_3/conv2d_10/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/concatenate_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_15/functional_3/re_lu_1/Relu", "StatefulPartitionedCall/functional_15/sequential_6/leaky_re_lu_6/LeakyRelu", "StatefulPartitionedCall/functional_15/concatenate_1/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15/functional_5/tf_op_layer_ResizeBilinear_2/ResizeBilinear_2", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/functional_15/concatenate_1/concat", "StatefulPartitionedCall/functional_15/functional_5/tf_op_layer_ResizeBilinear_2/ResizeBilinear_2/size"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_15/functional_5/conv2d_11/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_15/functional_5/tf_op_layer_ResizeBilinear_2/ResizeBilinear_2", "unknown_9"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/functional_15/functional_5/re_lu_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_15/functional_5/conv2d_11/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/concatenate_2/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_15/functional_5/re_lu_2/Relu", "StatefulPartitionedCall/functional_15/sequential_5/leaky_re_lu_5/LeakyRelu", "StatefulPartitionedCall/functional_15/concatenate_2/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/functional_15/functional_7/tf_op_layer_ResizeBilinear_3/ResizeBilinear_3", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/functional_15/concatenate_2/concat", "StatefulPartitionedCall/functional_15/functional_7/tf_op_layer_ResizeBilinear_3/ResizeBilinear_3/size"], "attr": {"_cloned": {"b": true}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/functional_7/conv2d_12/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_15/functional_7/tf_op_layer_ResizeBilinear_3/ResizeBilinear_3", "unknown_10"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/functional_7/re_lu_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_15/functional_7/conv2d_12/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/concatenate_3/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_15/functional_7/re_lu_3/Relu", "StatefulPartitionedCall/functional_15/sequential_4/leaky_re_lu_4/LeakyRelu", "StatefulPartitionedCall/functional_15/concatenate_3/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15/functional_9/tf_op_layer_ResizeBilinear_4/ResizeBilinear_4", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/functional_15/concatenate_3/concat", "StatefulPartitionedCall/functional_15/functional_9/tf_op_layer_ResizeBilinear_4/ResizeBilinear_4/size"], "attr": {"_cloned": {"b": true}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/functional_9/conv2d_13/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_15/functional_9/tf_op_layer_ResizeBilinear_4/ResizeBilinear_4", "unknown_11"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/functional_15/functional_9/re_lu_4/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_15/functional_9/conv2d_13/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/concatenate_4/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_15/functional_9/re_lu_4/Relu", "StatefulPartitionedCall/functional_15/sequential_3/leaky_re_lu_3/LeakyRelu", "StatefulPartitionedCall/functional_15/concatenate_4/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/functional_11/tf_op_layer_ResizeBilinear_5/ResizeBilinear_5", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/functional_15/concatenate_4/concat", "StatefulPartitionedCall/functional_15/functional_11/tf_op_layer_ResizeBilinear_5/ResizeBilinear_5/size"], "attr": {"_cloned": {"b": true}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/functional_11/conv2d_14/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_15/functional_11/tf_op_layer_ResizeBilinear_5/ResizeBilinear_5", "unknown_12"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/functional_15/functional_11/re_lu_5/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_15/functional_11/conv2d_14/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/concatenate_5/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_15/functional_11/re_lu_5/Relu", "StatefulPartitionedCall/functional_15/sequential_2/leaky_re_lu_2/LeakyRelu", "StatefulPartitionedCall/functional_15/concatenate_5/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/functional_15/functional_13/tf_op_layer_ResizeBilinear_6/ResizeBilinear_6", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/functional_15/concatenate_5/concat", "StatefulPartitionedCall/functional_15/functional_13/tf_op_layer_ResizeBilinear_6/ResizeBilinear_6/size"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_15/functional_13/conv2d_15/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_15/functional_13/tf_op_layer_ResizeBilinear_6/ResizeBilinear_6", "unknown_13"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/functional_15/functional_13/re_lu_6/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_15/functional_13/conv2d_15/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15/concatenate_6/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_15/functional_13/re_lu_6/Relu", "StatefulPartitionedCall/functional_15/sequential_1/leaky_re_lu_1/LeakyRelu", "StatefulPartitionedCall/functional_15/concatenate_6/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/functional_15/conv2d_transpose/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_15/concatenate_6/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15/conv2d_transpose/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_15/conv2d_transpose/Shape", "StatefulPartitionedCall/functional_15/conv2d_transpose/strided_slice/stack", "StatefulPartitionedCall/functional_15/conv2d_transpose/strided_slice/stack_1", "StatefulPartitionedCall/functional_15/conv2d_transpose/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_15/conv2d_transpose/stack", "op": "Pack", "input": ["StatefulPartitionedCall/functional_15/conv2d_transpose/strided_slice", "StatefulPartitionedCall/functional_15/conv2d_transpose/stack/1", "StatefulPartitionedCall/functional_15/conv2d_transpose/stack/2", "StatefulPartitionedCall/functional_15/conv2d_transpose/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/functional_15/conv2d_transpose/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/functional_15/conv2d_transpose/stack", "unknown_14", "StatefulPartitionedCall/functional_15/concatenate_6/concat"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/functional_15/conv2d_transpose/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_15/conv2d_transpose/conv2d_transpose", "unknown_15"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/functional_15/conv2d_transpose/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/functional_15/conv2d_transpose/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_15/conv2d_transpose/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of52.bin", "group1-shard2of52.bin", "group1-shard3of52.bin", "group1-shard4of52.bin", "group1-shard5of52.bin", "group1-shard6of52.bin", "group1-shard7of52.bin", "group1-shard8of52.bin", "group1-shard9of52.bin", "group1-shard10of52.bin", "group1-shard11of52.bin", "group1-shard12of52.bin", "group1-shard13of52.bin", "group1-shard14of52.bin", "group1-shard15of52.bin", "group1-shard16of52.bin", "group1-shard17of52.bin", "group1-shard18of52.bin", "group1-shard19of52.bin", "group1-shard20of52.bin", "group1-shard21of52.bin", "group1-shard22of52.bin", "group1-shard23of52.bin", "group1-shard24of52.bin", "group1-shard25of52.bin", "group1-shard26of52.bin", "group1-shard27of52.bin", "group1-shard28of52.bin", "group1-shard29of52.bin", "group1-shard30of52.bin", "group1-shard31of52.bin", "group1-shard32of52.bin", "group1-shard33of52.bin", "group1-shard34of52.bin", "group1-shard35of52.bin", "group1-shard36of52.bin", "group1-shard37of52.bin", "group1-shard38of52.bin", "group1-shard39of52.bin", "group1-shard40of52.bin", "group1-shard41of52.bin", "group1-shard42of52.bin", "group1-shard43of52.bin", "group1-shard44of52.bin", "group1-shard45of52.bin", "group1-shard46of52.bin", "group1-shard47of52.bin", "group1-shard48of52.bin", "group1-shard49of52.bin", "group1-shard50of52.bin", "group1-shard51of52.bin", "group1-shard52of52.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_15/conv2d_transpose/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_15/conv2d_transpose/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_15/conv2d_transpose/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_15/conv2d_transpose/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_15/conv2d_transpose/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_15/conv2d_transpose/stack/3", "shape": [], "dtype": "int32"}, {"name": "unknown_14", "shape": [4, 4, 3, 128], "dtype": "float32"}, {"name": "unknown_6", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_15/functional_1/tf_op_layer_ResizeBilinear/ResizeBilinear/size", "shape": [2], "dtype": "int32"}, {"name": "unknown_7", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "unknown_5", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_15/concatenate/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_15/functional_3/tf_op_layer_ResizeBilinear_1/ResizeBilinear_1/size", "shape": [2], "dtype": "int32"}, {"name": "unknown_8", "shape": [4, 4, 1024, 512], "dtype": "float32"}, {"name": "unknown_4", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_15/concatenate_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_15/functional_5/tf_op_layer_ResizeBilinear_2/ResizeBilinear_2/size", "shape": [2], "dtype": "int32"}, {"name": "unknown_9", "shape": [4, 4, 1024, 512], "dtype": "float32"}, {"name": "unknown_3", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_15/concatenate_2/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_15/functional_7/tf_op_layer_ResizeBilinear_3/ResizeBilinear_3/size", "shape": [2], "dtype": "int32"}, {"name": "unknown_10", "shape": [4, 4, 1024, 512], "dtype": "float32"}, {"name": "unknown_2", "shape": [4, 4, 256, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_15/concatenate_3/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_15/functional_9/tf_op_layer_ResizeBilinear_4/ResizeBilinear_4/size", "shape": [2], "dtype": "int32"}, {"name": "unknown_11", "shape": [4, 4, 1024, 256], "dtype": "float32"}, {"name": "unknown_1", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_15/concatenate_4/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_15/functional_11/tf_op_layer_ResizeBilinear_5/ResizeBilinear_5/size", "shape": [2], "dtype": "int32"}, {"name": "unknown_12", "shape": [4, 4, 512, 128], "dtype": "float32"}, {"name": "unknown_0", "shape": [4, 4, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_15/concatenate_5/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_15/functional_13/tf_op_layer_ResizeBilinear_6/ResizeBilinear_6/size", "shape": [2], "dtype": "int32"}, {"name": "unknown_13", "shape": [4, 4, 256, 64], "dtype": "float32"}, {"name": "unknown", "shape": [4, 4, 3, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_15/concatenate_6/concat/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_15", "shape": [3], "dtype": "float32"}]}]}