{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of52.bin", "group1-shard2of52.bin", "group1-shard3of52.bin", "group1-shard4of52.bin", "group1-shard5of52.bin", "group1-shard6of52.bin", "group1-shard7of52.bin", "group1-shard8of52.bin", "group1-shard9of52.bin", "group1-shard10of52.bin", "group1-shard11of52.bin", "group1-shard12of52.bin", "group1-shard13of52.bin", "group1-shard14of52.bin", "group1-shard15of52.bin", "group1-shard16of52.bin", "group1-shard17of52.bin", "group1-shard18of52.bin", "group1-shard19of52.bin", "group1-shard20of52.bin", "group1-shard21of52.bin", "group1-shard22of52.bin", "group1-shard23of52.bin", "group1-shard24of52.bin", "group1-shard25of52.bin", "group1-shard26of52.bin", "group1-shard27of52.bin", "group1-shard28of52.bin", "group1-shard29of52.bin", "group1-shard30of52.bin", "group1-shard31of52.bin", "group1-shard32of52.bin", "group1-shard33of52.bin", "group1-shard34of52.bin", "group1-shard35of52.bin", "group1-shard36of52.bin", "group1-shard37of52.bin", "group1-shard38of52.bin", "group1-shard39of52.bin", "group1-shard40of52.bin", "group1-shard41of52.bin", "group1-shard42of52.bin", "group1-shard43of52.bin", "group1-shard44of52.bin", "group1-shard45of52.bin", "group1-shard46of52.bin", "group1-shard47of52.bin", "group1-shard48of52.bin", "group1-shard49of52.bin", "group1-shard50of52.bin", "group1-shard51of52.bin", "group1-shard52of52.bin"], "weights": [{"name": "sequential_108/conv2d_165/kernel", "shape": [4, 4, 3, 64], "dtype": "float32"}, {"name": "sequential_109/conv2d_166/kernel", "shape": [4, 4, 64, 128], "dtype": "float32"}, {"name": "sequential_109/batch_normalization_154/gamma", "shape": [128], "dtype": "float32"}, {"name": "sequential_109/batch_normalization_154/beta", "shape": [128], "dtype": "float32"}, {"name": "sequential_109/batch_normalization_154/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "sequential_109/batch_normalization_154/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "sequential_110/conv2d_167/kernel", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "sequential_110/batch_normalization_155/gamma", "shape": [256], "dtype": "float32"}, {"name": "sequential_110/batch_normalization_155/beta", "shape": [256], "dtype": "float32"}, {"name": "sequential_110/batch_normalization_155/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "sequential_110/batch_normalization_155/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "sequential_111/conv2d_168/kernel", "shape": [4, 4, 256, 512], "dtype": "float32"}, {"name": "sequential_111/batch_normalization_156/gamma", "shape": [512], "dtype": "float32"}, {"name": "sequential_111/batch_normalization_156/beta", "shape": [512], "dtype": "float32"}, {"name": "sequential_111/batch_normalization_156/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sequential_111/batch_normalization_156/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sequential_112/conv2d_169/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "sequential_112/batch_normalization_157/gamma", "shape": [512], "dtype": "float32"}, {"name": "sequential_112/batch_normalization_157/beta", "shape": [512], "dtype": "float32"}, {"name": "sequential_112/batch_normalization_157/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sequential_112/batch_normalization_157/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sequential_113/conv2d_170/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "sequential_113/batch_normalization_158/gamma", "shape": [512], "dtype": "float32"}, {"name": "sequential_113/batch_normalization_158/beta", "shape": [512], "dtype": "float32"}, {"name": "sequential_113/batch_normalization_158/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sequential_113/batch_normalization_158/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sequential_114/conv2d_171/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "sequential_114/batch_normalization_159/gamma", "shape": [512], "dtype": "float32"}, {"name": "sequential_114/batch_normalization_159/beta", "shape": [512], "dtype": "float32"}, {"name": "sequential_114/batch_normalization_159/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sequential_114/batch_normalization_159/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sequential_115/conv2d_172/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "sequential_115/batch_normalization_160/gamma", "shape": [512], "dtype": "float32"}, {"name": "sequential_115/batch_normalization_160/beta", "shape": [512], "dtype": "float32"}, {"name": "sequential_115/batch_normalization_160/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sequential_115/batch_normalization_160/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_173/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "batch_normalization_161/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_161/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_161/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_161/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_174/kernel", "shape": [4, 4, 1024, 512], "dtype": "float32"}, {"name": "batch_normalization_162/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_162/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_162/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_162/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_175/kernel", "shape": [4, 4, 1024, 512], "dtype": "float32"}, {"name": "batch_normalization_163/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_163/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_163/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_163/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_176/kernel", "shape": [4, 4, 1024, 512], "dtype": "float32"}, {"name": "batch_normalization_164/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_164/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_164/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_164/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_177/kernel", "shape": [4, 4, 1024, 256], "dtype": "float32"}, {"name": "batch_normalization_165/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_165/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_165/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_165/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2d_178/kernel", "shape": [4, 4, 512, 128], "dtype": "float32"}, {"name": "batch_normalization_166/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_166/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_166/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_166/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv2d_179/kernel", "shape": [4, 4, 256, 64], "dtype": "float32"}, {"name": "batch_normalization_167/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_167/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_167/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_167/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_15/kernel", "shape": [4, 4, 3, 128], "dtype": "float32"}, {"name": "conv2d_transpose_15/bias", "shape": [3], "dtype": "float32"}]}]}