{"format": "graph-model", "generatedBy": "2.3.1", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"input_2:0": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_17/conv2d_transpose_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_17/conv2d_transpose_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_17/conv2d_transpose_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_17/conv2d_transpose_1/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_17/conv2d_transpose_1/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_17/conv2d_transpose_1/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_70", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_3/tf_op_layer_ResizeBilinear_1/ResizeBilinear_1/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_17/concatenate/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_5/tf_op_layer_ResizeBilinear_2/ResizeBilinear_2/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_17/concatenate_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_7/tf_op_layer_ResizeBilinear_3/ResizeBilinear_3/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_17/concatenate_2/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_9/tf_op_layer_ResizeBilinear_4/ResizeBilinear_4/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_17/concatenate_3/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_11/tf_op_layer_ResizeBilinear_5/ResizeBilinear_5/size", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/functional_17/concatenate_4/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_13/tf_op_layer_ResizeBilinear_6/ResizeBilinear_6/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_17/concatenate_5/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_15/tf_op_layer_ResizeBilinear_7/ResizeBilinear_7/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/concatenate_6/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_71", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_3/conv2d_3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_3/conv2d_3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_4/conv2d_4/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_13/conv2d_15/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_4/conv2d_4/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_5/conv2d_5/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_5/conv2d_5/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_6/conv2d_6/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_13/conv2d_15/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_6/conv2d_6/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_7/conv2d_7/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_7/conv2d_7/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_8/conv2d_8/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_8/conv2d_8/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_9/conv2d_9/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_9/conv2d_9/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_3/conv2d_10/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_17/functional_3/conv2d_10/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_15/conv2d_16/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "256"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_5/conv2d_11/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_5/conv2d_11/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_15/conv2d_16/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_7/conv2d_12/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_7/conv2d_12/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_9/conv2d_13/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_9/conv2d_13/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_11/conv2d_14/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "1024"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_11/conv2d_14/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_2/conv2d_2/Conv2D", "op": "Conv2D", "input": ["input_2", "unknown"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_2/leaky_re_lu_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_17/sequential_2/conv2d_2/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_3/batch_normalization_3/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_17/sequential_2/leaky_re_lu_1/LeakyRelu", "StatefulPartitionedCall/functional_17/sequential_3/conv2d_3/Conv2D_weights", "StatefulPartitionedCall/functional_17/sequential_3/conv2d_3/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_3/leaky_re_lu_2/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_17/sequential_3/batch_normalization_3/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_4/batch_normalization_4/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_17/sequential_3/leaky_re_lu_2/LeakyRelu", "StatefulPartitionedCall/functional_17/sequential_4/conv2d_4/Conv2D_weights", "StatefulPartitionedCall/functional_17/sequential_4/conv2d_4/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_4/leaky_re_lu_3/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_17/sequential_4/batch_normalization_4/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_5/batch_normalization_5/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_17/sequential_4/leaky_re_lu_3/LeakyRelu", "StatefulPartitionedCall/functional_17/sequential_5/conv2d_5/Conv2D_weights", "StatefulPartitionedCall/functional_17/sequential_5/conv2d_5/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_5/leaky_re_lu_4/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_17/sequential_5/batch_normalization_5/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_6/batch_normalization_6/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_17/sequential_5/leaky_re_lu_4/LeakyRelu", "StatefulPartitionedCall/functional_17/sequential_6/conv2d_6/Conv2D_weights", "StatefulPartitionedCall/functional_17/sequential_6/conv2d_6/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_6/leaky_re_lu_5/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_17/sequential_6/batch_normalization_6/FusedBatchNormV3"], "attr": {"alpha": {"f": 0.30000001192092896}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_7/batch_normalization_7/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_17/sequential_6/leaky_re_lu_5/LeakyRelu", "StatefulPartitionedCall/functional_17/sequential_7/conv2d_7/Conv2D_weights", "StatefulPartitionedCall/functional_17/sequential_7/conv2d_7/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_7/leaky_re_lu_6/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_17/sequential_7/batch_normalization_7/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_8/batch_normalization_8/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_17/sequential_7/leaky_re_lu_6/LeakyRelu", "StatefulPartitionedCall/functional_17/sequential_8/conv2d_8/Conv2D_weights", "StatefulPartitionedCall/functional_17/sequential_8/conv2d_8/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_8/leaky_re_lu_7/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_17/sequential_8/batch_normalization_8/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_9/batch_normalization_9/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_17/sequential_8/leaky_re_lu_7/LeakyRelu", "StatefulPartitionedCall/functional_17/sequential_9/conv2d_9/Conv2D_weights", "StatefulPartitionedCall/functional_17/sequential_9/conv2d_9/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/functional_17/sequential_9/leaky_re_lu_8/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_17/sequential_9/batch_normalization_9/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/functional_17/functional_3/tf_op_layer_ResizeBilinear_1/ResizeBilinear_1", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/functional_17/sequential_9/leaky_re_lu_8/LeakyRelu", "StatefulPartitionedCall/functional_17/functional_3/tf_op_layer_ResizeBilinear_1/ResizeBilinear_1/size"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_17/functional_3/re_lu_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_17/functional_3/tf_op_layer_ResizeBilinear_1/ResizeBilinear_1", "StatefulPartitionedCall/functional_17/functional_3/conv2d_10/Conv2D_weights", "StatefulPartitionedCall/functional_17/functional_3/conv2d_10/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/functional_17/concatenate/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_17/functional_3/re_lu_2/Relu", "StatefulPartitionedCall/functional_17/sequential_8/leaky_re_lu_7/LeakyRelu", "StatefulPartitionedCall/functional_17/concatenate/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_5/tf_op_layer_ResizeBilinear_2/ResizeBilinear_2", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/functional_17/concatenate/concat", "StatefulPartitionedCall/functional_17/functional_5/tf_op_layer_ResizeBilinear_2/ResizeBilinear_2/size"], "attr": {"half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}, "align_corners": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_17/functional_5/re_lu_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_17/functional_5/tf_op_layer_ResizeBilinear_2/ResizeBilinear_2", "StatefulPartitionedCall/functional_17/functional_5/conv2d_11/Conv2D_weights", "StatefulPartitionedCall/functional_17/functional_5/conv2d_11/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/functional_17/concatenate_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_17/functional_5/re_lu_3/Relu", "StatefulPartitionedCall/functional_17/sequential_7/leaky_re_lu_6/LeakyRelu", "StatefulPartitionedCall/functional_17/concatenate_1/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_7/tf_op_layer_ResizeBilinear_3/ResizeBilinear_3", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/functional_17/concatenate_1/concat", "StatefulPartitionedCall/functional_17/functional_7/tf_op_layer_ResizeBilinear_3/ResizeBilinear_3/size"], "attr": {"_cloned": {"b": true}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_7/re_lu_4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_17/functional_7/tf_op_layer_ResizeBilinear_3/ResizeBilinear_3", "StatefulPartitionedCall/functional_17/functional_7/conv2d_12/Conv2D_weights", "StatefulPartitionedCall/functional_17/functional_7/conv2d_12/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/functional_17/concatenate_2/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_17/functional_7/re_lu_4/Relu", "StatefulPartitionedCall/functional_17/sequential_6/leaky_re_lu_5/LeakyRelu", "StatefulPartitionedCall/functional_17/concatenate_2/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_9/tf_op_layer_ResizeBilinear_4/ResizeBilinear_4", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/functional_17/concatenate_2/concat", "StatefulPartitionedCall/functional_17/functional_9/tf_op_layer_ResizeBilinear_4/ResizeBilinear_4/size"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_17/functional_9/re_lu_5/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_17/functional_9/tf_op_layer_ResizeBilinear_4/ResizeBilinear_4", "StatefulPartitionedCall/functional_17/functional_9/conv2d_13/Conv2D_weights", "StatefulPartitionedCall/functional_17/functional_9/conv2d_13/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/functional_17/concatenate_3/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_17/functional_9/re_lu_5/Relu", "StatefulPartitionedCall/functional_17/sequential_5/leaky_re_lu_4/LeakyRelu", "StatefulPartitionedCall/functional_17/concatenate_3/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_11/tf_op_layer_ResizeBilinear_5/ResizeBilinear_5", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/functional_17/concatenate_3/concat", "StatefulPartitionedCall/functional_17/functional_11/tf_op_layer_ResizeBilinear_5/ResizeBilinear_5/size"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_17/functional_11/re_lu_6/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_17/functional_11/tf_op_layer_ResizeBilinear_5/ResizeBilinear_5", "StatefulPartitionedCall/functional_17/functional_11/conv2d_14/Conv2D_weights", "StatefulPartitionedCall/functional_17/functional_11/conv2d_14/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/functional_17/concatenate_4/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_17/functional_11/re_lu_6/Relu", "StatefulPartitionedCall/functional_17/sequential_4/leaky_re_lu_3/LeakyRelu", "StatefulPartitionedCall/functional_17/concatenate_4/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_13/tf_op_layer_ResizeBilinear_6/ResizeBilinear_6", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/functional_17/concatenate_4/concat", "StatefulPartitionedCall/functional_17/functional_13/tf_op_layer_ResizeBilinear_6/ResizeBilinear_6/size"], "attr": {"half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}, "align_corners": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_17/functional_13/re_lu_7/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_17/functional_13/tf_op_layer_ResizeBilinear_6/ResizeBilinear_6", "StatefulPartitionedCall/functional_17/functional_13/conv2d_15/Conv2D_weights", "StatefulPartitionedCall/functional_17/functional_13/conv2d_15/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_17/concatenate_5/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_17/functional_13/re_lu_7/Relu", "StatefulPartitionedCall/functional_17/sequential_3/leaky_re_lu_2/LeakyRelu", "StatefulPartitionedCall/functional_17/concatenate_5/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_15/tf_op_layer_ResizeBilinear_7/ResizeBilinear_7", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/functional_17/concatenate_5/concat", "StatefulPartitionedCall/functional_17/functional_15/tf_op_layer_ResizeBilinear_7/ResizeBilinear_7/size"], "attr": {"_cloned": {"b": true}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_17/functional_15/re_lu_8/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_17/functional_15/tf_op_layer_ResizeBilinear_7/ResizeBilinear_7", "StatefulPartitionedCall/functional_17/functional_15/conv2d_16/Conv2D_weights", "StatefulPartitionedCall/functional_17/functional_15/conv2d_16/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/functional_17/concatenate_6/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_17/functional_15/re_lu_8/Relu", "StatefulPartitionedCall/functional_17/sequential_2/leaky_re_lu_1/LeakyRelu", "StatefulPartitionedCall/functional_17/concatenate_6/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_17/conv2d_transpose_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_17/concatenate_6/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_17/conv2d_transpose_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_17/conv2d_transpose_1/Shape", "StatefulPartitionedCall/functional_17/conv2d_transpose_1/strided_slice/stack", "StatefulPartitionedCall/functional_17/conv2d_transpose_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_17/conv2d_transpose_1/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/functional_17/conv2d_transpose_1/stack", "op": "Pack", "input": ["StatefulPartitionedCall/functional_17/conv2d_transpose_1/strided_slice", "StatefulPartitionedCall/functional_17/conv2d_transpose_1/stack/1", "StatefulPartitionedCall/functional_17/conv2d_transpose_1/stack/2", "StatefulPartitionedCall/functional_17/conv2d_transpose_1/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/functional_17/conv2d_transpose_1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/functional_17/conv2d_transpose_1/stack", "unknown_70", "StatefulPartitionedCall/functional_17/concatenate_6/concat"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/functional_17/conv2d_transpose_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_17/conv2d_transpose_1/conv2d_transpose", "unknown_71"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/functional_17/conv2d_transpose_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/functional_17/conv2d_transpose_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_17/conv2d_transpose_1/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of52.bin", "group1-shard2of52.bin", "group1-shard3of52.bin", "group1-shard4of52.bin", "group1-shard5of52.bin", "group1-shard6of52.bin", "group1-shard7of52.bin", "group1-shard8of52.bin", "group1-shard9of52.bin", "group1-shard10of52.bin", "group1-shard11of52.bin", "group1-shard12of52.bin", "group1-shard13of52.bin", "group1-shard14of52.bin", "group1-shard15of52.bin", "group1-shard16of52.bin", "group1-shard17of52.bin", "group1-shard18of52.bin", "group1-shard19of52.bin", "group1-shard20of52.bin", "group1-shard21of52.bin", "group1-shard22of52.bin", "group1-shard23of52.bin", "group1-shard24of52.bin", "group1-shard25of52.bin", "group1-shard26of52.bin", "group1-shard27of52.bin", "group1-shard28of52.bin", "group1-shard29of52.bin", "group1-shard30of52.bin", "group1-shard31of52.bin", "group1-shard32of52.bin", "group1-shard33of52.bin", "group1-shard34of52.bin", "group1-shard35of52.bin", "group1-shard36of52.bin", "group1-shard37of52.bin", "group1-shard38of52.bin", "group1-shard39of52.bin", "group1-shard40of52.bin", "group1-shard41of52.bin", "group1-shard42of52.bin", "group1-shard43of52.bin", "group1-shard44of52.bin", "group1-shard45of52.bin", "group1-shard46of52.bin", "group1-shard47of52.bin", "group1-shard48of52.bin", "group1-shard49of52.bin", "group1-shard50of52.bin", "group1-shard51of52.bin", "group1-shard52of52.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_17/conv2d_transpose_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_17/conv2d_transpose_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_17/conv2d_transpose_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_17/conv2d_transpose_1/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_17/conv2d_transpose_1/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_17/conv2d_transpose_1/stack/3", "shape": [], "dtype": "int32"}, {"name": "unknown_70", "shape": [4, 4, 3, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/functional_3/tf_op_layer_ResizeBilinear_1/ResizeBilinear_1/size", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_17/concatenate/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_17/functional_5/tf_op_layer_ResizeBilinear_2/ResizeBilinear_2/size", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_17/concatenate_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_17/functional_7/tf_op_layer_ResizeBilinear_3/ResizeBilinear_3/size", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_17/concatenate_2/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_17/functional_9/tf_op_layer_ResizeBilinear_4/ResizeBilinear_4/size", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_17/concatenate_3/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_17/functional_11/tf_op_layer_ResizeBilinear_5/ResizeBilinear_5/size", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_17/concatenate_4/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_17/functional_13/tf_op_layer_ResizeBilinear_6/ResizeBilinear_6/size", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_17/concatenate_5/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_17/functional_15/tf_op_layer_ResizeBilinear_7/ResizeBilinear_7/size", "shape": [2], "dtype": "int32"}, {"name": "unknown", "shape": [4, 4, 3, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/concatenate_6/concat/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_71", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/sequential_3/conv2d_3/Conv2D_weights", "shape": [4, 4, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/sequential_3/conv2d_3/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/sequential_4/conv2d_4/Conv2D_weights", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/functional_13/conv2d_15/Conv2D_weights", "shape": [4, 4, 512, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/sequential_4/conv2d_4/Conv2D_bn_offset", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/sequential_5/conv2d_5/Conv2D_weights", "shape": [4, 4, 256, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/sequential_5/conv2d_5/Conv2D_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/sequential_6/conv2d_6/Conv2D_weights", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/functional_13/conv2d_15/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/sequential_6/conv2d_6/Conv2D_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/sequential_7/conv2d_7/Conv2D_weights", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/sequential_7/conv2d_7/Conv2D_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/sequential_8/conv2d_8/Conv2D_weights", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/sequential_8/conv2d_8/Conv2D_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/sequential_9/conv2d_9/Conv2D_weights", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/sequential_9/conv2d_9/Conv2D_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/functional_3/conv2d_10/Conv2D_weights", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/functional_3/conv2d_10/Conv2D_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/functional_15/conv2d_16/Conv2D_weights", "shape": [4, 4, 256, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/functional_5/conv2d_11/Conv2D_weights", "shape": [4, 4, 1024, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/functional_5/conv2d_11/Conv2D_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/functional_15/conv2d_16/Conv2D_bn_offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/functional_7/conv2d_12/Conv2D_weights", "shape": [4, 4, 1024, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/functional_7/conv2d_12/Conv2D_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/functional_9/conv2d_13/Conv2D_weights", "shape": [4, 4, 1024, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/functional_9/conv2d_13/Conv2D_bn_offset", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/functional_11/conv2d_14/Conv2D_weights", "shape": [4, 4, 1024, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_17/functional_11/conv2d_14/Conv2D_bn_offset", "shape": [256], "dtype": "float32"}]}]}